In [2]:
import numpy as np 
import pandas as pd

In [2]:
%pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\learning\anaconda3\lib\site-packages (9.2.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
import mysql.connector as mysql
from mysql.connector import errorcode

ds_host = "localhost"
db_username = "root"
db_password = "qiwoqqwu"

try:
    conn = mysql.connect(
        host=ds_host,
        port=3306,
        user=db_username,
        password=db_password,
        database = "week10"
    )
    cursor = conn.cursor()




except mysql.Error as err:
    print(" Lỗi:", err)

In [7]:
    # Câu lệnh tạo database
cursor.execute("CREATE DATABASE IF NOT EXISTS week10")
print(" Đã tạo (hoặc đã tồn tại) database 'week10'.")

 Đã tạo (hoặc đã tồn tại) database 'week10'.

In [9]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS customers (
    id INT PRIMARY KEY,
    name VARCHAR(255),
    city VARCHAR(255)
);
""")
print(" Đã tạo bảng 'customers'")

customers_data = [
    (1, "Alice", "Hanoi"),
    (2, "Bob", "Ho Chi Minh"),
    (3, "Charlie", "Hanoi")
]

cursor.executemany("INSERT INTO customers (id, name, city) VALUES (%s, %s, %s)", customers_data)
conn.commit()
print("Đã chèn dữ liệu vào bảng 'customers'")

 Đã tạo bảng 'customers'
Đã chèn dữ liệu vào bảng 'customers'

In [10]:
# Đọc dữ liệu từ bảng 'customers' vào pandas DataFrame
query = "SELECT * FROM customers"
data = pd.read_sql(query, conn)

data.tail()

C:\Users\Learning\AppData\Local\Temp\ipykernel_11116\3863311719.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql(query, conn)

   id     name         city
0   1    Alice        Hanoi
1   2      Bob  Ho Chi Minh
2   3  Charlie        Hanoi

In [11]:

cursor.execute("""
CREATE TABLE IF NOT EXISTS orders (
    id INT PRIMARY KEY,
    customer INT,
    order_date DATE,
    total INT,
    FOREIGN KEY (customer) REFERENCES customers(id)
);
""")
print(" Đã tạo bảng 'orders'")

orders_data = [
    (1, 1, "2024-01-01", 600),
    (2, 2, "2024-03-01", 800),
    (3, 3, "2024-02-02", 1200),
    (4, 3, "2024-01-15", 200)
]


cursor.executemany("INSERT INTO orders (id, customer, order_date, total) VALUES (%s, %s, %s, %s)", orders_data)
conn.commit()
print(" Đã chèn dữ liệu vào bảng 'orders'")

 Đã tạo bảng 'orders'
 Đã chèn dữ liệu vào bảng 'orders'

In [12]:
query1 = "SELECT * FROM orders"
data2 = pd.read_sql(query1, conn)

data2.tail()

C:\Users\Learning\AppData\Local\Temp\ipykernel_11116\1718959790.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data2 = pd.read_sql(query1, conn)

   id  customer  order_date  total
0   1         1  2024-01-01    600
1   2         2  2024-03-01    800
2   3         3  2024-02-02   1200
3   4         3  2024-01-15    200

In [13]:
# Tạo bảng products
cursor.execute("""
CREATE TABLE IF NOT EXISTS products (
    id INT PRIMARY KEY,
    name VARCHAR(255),
    price INT
);
""")
print("Đã tạo bảng 'products'")

# Chèn dữ liệu vào bảng products
products_data = [
    (1, "Laptop", 1500),
    (2, "Mouse", 100),
    (3, "Keyboard", 50),
    (4, "Monitor", 300)
]

# Dùng %s thay vì ? cho MySQL
cursor.executemany("INSERT INTO products (id, name, price) VALUES (%s, %s, %s)", products_data)
conn.commit()
print(" Đã chèn dữ liệu vào bảng 'products'")

Đã tạo bảng 'products'
 Đã chèn dữ liệu vào bảng 'products'

In [15]:
query3 = "SELECT * FROM orders"
data3 = pd.read_sql(query3, conn)

data3.tail()

C:\Users\Learning\AppData\Local\Temp\ipykernel_11116\1086439832.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data3 = pd.read_sql(query3, conn)

   id  customer  order_date  total
0   1         1  2024-01-01    600
1   2         2  2024-03-01    800
2   3         3  2024-02-02   1200
3   4         3  2024-01-15    200

In [16]:
# Tạo bảng order_items
cursor.execute("""
CREATE TABLE IF NOT EXISTS order_items (
    id INT AUTO_INCREMENT PRIMARY KEY,
    order_id INT,
    product_id INT,
    quantity INT,
    FOREIGN KEY (order_id) REFERENCES orders(id),
    FOREIGN KEY (product_id) REFERENCES products(id)
);
""")
print(" Đã tạo bảng 'order_items'")

# Chèn dữ liệu vào bảng order_items
order_items_data = [
    (1, 2, 2), 
    (1, 3, 1), 
    (2, 1, 1), 
    (2, 4, 1), 
    (3, 1, 1), 
]

# Dùng %s thay vì ? cho MySQL
cursor.executemany("INSERT INTO order_items (order_id, product_id, quantity) VALUES (%s, %s, %s)", order_items_data)
conn.commit()
print(" Đã chèn dữ liệu vào bảng 'order_items'")

 Đã tạo bảng 'order_items'
 Đã chèn dữ liệu vào bảng 'order_items'

In [3]:
query4 = "SELECT * FROM order_items"
data4 = pd.read_sql(query4, conn)

data4.tail()

C:\Users\Learning\AppData\Local\Temp\ipykernel_17080\411246200.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data4 = pd.read_sql(query4, conn)

   id  order_id  product_id  quantity
0   1         1           2         2
1   2         1           3         1
2   3         2           1         1
3   4         2           4         1
4   5         3           1         1

In [18]:
# Tạo bảng employees
cursor.execute("""
CREATE TABLE IF NOT EXISTS employees (
    id INTEGER PRIMARY KEY,
    name TEXT,
    department TEXT
);
""")
print(" Đã tạo bảng 'employees'")

# Chèn dữ liệu vào bảng employees (Sử dụng %s cho MySQL)
employees_data = [(1, "David", "Sales"), (2, "Emma", "Support"), (3, "Frank", "Sales")]
cursor.executemany("INSERT INTO employees VALUES (%s, %s, %s)", employees_data)
conn.commit()
print("Đã chèn dữ liệu vào bảng 'employees'")

 Đã tạo bảng 'employees'
Đã chèn dữ liệu vào bảng 'employees'

In [19]:
query5 = "SELECT * FROM employees"
data5 = pd.read_sql(query5, conn)

data5.tail()

C:\Users\Learning\AppData\Local\Temp\ipykernel_11116\1368582034.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data5 = pd.read_sql(query5, conn)

   id   name department
0   1  David      Sales
1   2   Emma    Support
2   3  Frank      Sales

In [20]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS order_assignments (
    id INT AUTO_INCREMENT,           -- Cột id tự động tăng
    order_id INT,
    employee_id INT,
    PRIMARY KEY (id, order_id, employee_id),  -- Khóa chính kết hợp (composite key) gồm 3 cột
    FOREIGN KEY (order_id) REFERENCES orders(id),
    FOREIGN KEY (employee_id) REFERENCES employees(id)
);
""")
print(" Đã tạo bảng 'order_assignments' với composite key gồm 3 cột")

order_assignments_data = [(1, 1, 1), (2, 2, 3), (3, 3, 2)]  # Cập nhật lại dữ liệu cho đúng với 3 cột khóa
cursor.executemany("INSERT INTO order_assignments (id, order_id, employee_id) VALUES (%s, %s, %s)", order_assignments_data)
conn.commit()
print("Đã chèn dữ liệu vào bảng 'order_assignments'")

 Đã tạo bảng 'order_assignments' với composite key gồm 3 cột
Đã chèn dữ liệu vào bảng 'order_assignments'

In [21]:
query6 = "SELECT * FROM order_assignments"
data6 = pd.read_sql(query6, conn)

data6.tail()

C:\Users\Learning\AppData\Local\Temp\ipykernel_11116\4109343897.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data6 = pd.read_sql(query6, conn)

   id  order_id  employee_id
0   1         1            1
1   2         2            3
2   3         3            2

In [22]:
# Để lấy danh sách các bảng
cursor.execute("SHOW TABLES")
tables = cursor.fetchall() #trả về tất cả các dòng (rows) của kết quả truy vấn dưới dạng một danh sách các tuple
#Đây là vòng lặp, lặp qua từng phần tử trong danh sách tables. Mỗi phần tử của tables là một tuple chứa tên bảng.
for table in tables:
    table_name = table[0]
    print(f"Hiển thị dữ liệu bảng: {table_name}")
    
    # Truy vấn tất cả dữ liệu từ bảng hiện tại
    cursor.execute(f"SELECT * FROM {table_name}")
    rows = cursor.fetchall()
    
    # Hiển thị dữ liệu
    for row in rows:
        print(row)
    print("\n")

Hiển thị dữ liệu bảng: customers
(1, 'Alice', 'Hanoi')
(2, 'Bob', 'Ho Chi Minh')
(3, 'Charlie', 'Hanoi')


Hiển thị dữ liệu bảng: employees
(1, 'David', 'Sales')
(2, 'Emma', 'Support')
(3, 'Frank', 'Sales')


Hiển thị dữ liệu bảng: order_assignments
(1, 1, 1)
(2, 2, 3)
(3, 3, 2)


Hiển thị dữ liệu bảng: order_items
(1, 1, 2, 2)
(2, 1, 3, 1)
(3, 2, 1, 1)
(4, 2, 4, 1)
(5, 3, 1, 1)


Hiển thị dữ liệu bảng: orders
(1, 1, datetime.date(2024, 1, 1), 600)
(2, 2, datetime.date(2024, 3, 1), 800)
(3, 3, datetime.date(2024, 2, 2), 1200)
(4, 3, datetime.date(2024, 1, 15), 200)


Hiển thị dữ liệu bảng: products
(1, 'Laptop', 1500)
(2, 'Mouse', 100)
(3, 'Keyboard', 50)
(4, 'Monitor', 300)

Subquery trong WHERE
Tìm tất cả khách hàng đã từng mua đơn hàng chứa sản phẩm có giá lớn hơn 1000

In [37]:
cau1 = """SELECT name
        FROM customers
        WHERE id IN (
                        SELECT customer
                        FROM orders
                        WHERE id IN (
                                        SELECT order_id
                                        FROM order_items
                                        WHERE product_id IN (
                                                        SELECT id
                                                        FROM products
                                                        WHERE price > 1000
                                )
        )
        );

        """
cau1df = pd.read_sql(cau1, conn)

cau1df.tail()

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_20904\2292377035.py:18: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cau1df = pd.read_sql(cau1, conn)

      name
0      Bob
1  Charlie

In [38]:
cau1a="""SELECT DISTINCT c.name
            FROM customers c
            JOIN orders o ON c.id = o.customer
            JOIN order_items oi ON o.id = oi.order_id
            JOIN products p ON oi.product_id = p.id
            WHERE p.price > 1000;"""
cau1dfa=pd.read_sql(cau1,conn)
cau1dfa.tail()

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_20904\3713680964.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cau1dfa=pd.read_sql(cau1,conn)

      name
0      Bob
1  Charlie

Subquery trong SELECT

Liệt kê tên từng khách hàng và tổng giá trị tất cả đơn hàng mà họ đã đặt.

In [41]:
cau2 = """SELECT 
                c.name,
                (
                    SELECT SUM(oi.quantity * p.price)
                    FROM orders o
                    JOIN order_items oi ON o.id = oi.order_id
                    JOIN products p ON oi.product_id = p.id
                    WHERE o.customer = c.id
                ) AS total_spent
            FROM customers c;

"""
cau2df=pd.read_sql(cau2,conn)
cau2df.tail()

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_20904\1451954508.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cau2df=pd.read_sql(cau2,conn)

      name  total_spent
0    Alice         50.0
1      Bob       2000.0
2  Charlie       1500.0

In [44]:
cau2sub ="""SELECT 
            c.name,
                    (
                        SELECT SUM(oi.quantity * p.price)
                        FROM order_items oi
                        LEFT JOIN products p ON oi.product_id = p.id
                        WHERE oi.order_id IN (
                                                SELECT o.id
                                                FROM orders o
                                                WHERE o.customer = c.id
                        )
                    ) AS total_spent
        FROM customers c;
"""

cau2dfa=pd.read_sql(cau2sub,conn)
cau2dfa.tail()

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_20904\542614336.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cau2dfa=pd.read_sql(cau2sub,conn)

      name  total_spent
0    Alice         50.0
1      Bob       2000.0
2  Charlie       1500.0

In [45]:
cau2c3 = """SELECT 
    c.name,
    (
        SELECT SUM(oi.quantity * (SELECT p.price FROM products p WHERE p.id = oi.product_id))
        FROM order_items oi
        WHERE oi.order_id IN (
            SELECT o.id
            FROM orders o
            WHERE o.customer = c.id
        )
    ) AS total_spent
FROM customers c;
"""
cau2df3=pd.read_sql(cau2c3,conn)
cau2df3.tail()

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_20904\1300902243.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cau2df3=pd.read_sql(cau2c3,conn)

      name  total_spent
0    Alice         50.0
1      Bob       2000.0
2  Charlie       1500.0

Subquery trong FROM
Hiển thị top 2 khách hàng có tổng chi tiêu cao nhất (dựa trên cột total của đơn
hàng).

In [57]:
cau3c1="""SELECT c.id, c.name, SUM(o.total) AS total_spent
            FROM customers c
            JOIN orders o ON c.id = o.id
            GROUP BY c.id, c.name
            ORDER BY total_spent DESC
            LIMIT 2;
"""
cau3df1=pd.read_sql(cau3c1,conn)
cau3df1.tail()

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_20904\710937030.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cau3df1=pd.read_sql(cau3c1,conn)

   id     name  total_spent
0   3  Charlie       1200.0
1   2      Bob        800.0

In [62]:
cau3c2 = """
SELECT c.id, c.name, top_customers.total_spent
FROM customers c,
    (SELECT o.id AS customer_id, SUM(o.total) AS total_spent
     FROM orders o
     GROUP BY o.id) AS top_customers
WHERE c.id = top_customers.customer_id
ORDER BY top_customers.total_spent DESC
LIMIT 2;
"""
cau3df2 = pd.read_sql(cau3c2, conn)
cau3df2.tail()

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_20904\323868752.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cau3df2 = pd.read_sql(cau3c2, conn)

   id     name  total_spent
0   3  Charlie       1200.0
1   2      Bob        800.0

In [65]:
cau4c1 = """SELECT e.name
FROM employees e
WHERE e.department = 'Sales'
AND EXISTS (
    SELECT 1
    FROM order_assignments oa
    JOIN orders o ON oa.order_id = o.id
    JOIN order_items oi ON o.id = oi.order_id
    JOIN products p ON oi.product_id = p.id
    WHERE oa.employee_id = e.id
    AND p.name = 'Monitor'
);


"""

cau4df1 = pd.read_sql(cau4c1, conn)
cau4df1.tail()

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_20904\4019004312.py:17: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cau4df1 = pd.read_sql(cau4c1, conn)

    name
0  Frank

In [66]:
cau4c2 = """SELECT e.name
FROM employees e
WHERE e.department = 'Sales'
AND EXISTS (
    SELECT 1
    FROM order_assignments oa
    WHERE oa.employee_id = e.id
    AND EXISTS (
        SELECT 1
        FROM orders o
        WHERE o.id = oa.order_id
        AND EXISTS (
            SELECT 1
            FROM order_items oi
            WHERE oi.order_id = o.id
            AND EXISTS (
                SELECT 1
                FROM products p
                WHERE p.id = oi.product_id
                AND p.name = 'Monitor'
            )
        )
    )
);
"""
cau4df2=pd.read_sql(cau4c2,conn)
cau4df2.tail()

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_20904\580007733.py:26: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cau4df2=pd.read_sql(cau4c2,conn)

    name
0  Frank

In [69]:
cau5c1="""SELECT c.name, SUM(oi.quantity * p.price) AS total_spent
FROM customers c
JOIN orders o ON o.customer = c.id   -- Sử dụng cột 'customer' trong bảng 'orders'
JOIN order_items oi ON oi.order_id = o.id
JOIN products p ON p.id = oi.product_id
GROUP BY c.id
HAVING SUM(oi.quantity * p.price) > (
    SELECT AVG(total_spent)
    FROM (
        SELECT SUM(oi.quantity * p.price) AS total_spent
        FROM customers c
        JOIN orders o ON o.customer = c.id   -- Sử dụng cột 'customer' trong bảng 'orders'
        JOIN order_items oi ON oi.order_id = o.id
        JOIN products p ON p.id = oi.product_id
        GROUP BY c.id
    ) AS avg_spent
);


"""
cau5df1 = pd.read_sql(cau5c1,conn)
cau5df1

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_20904\2493567142.py:21: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cau5df1 = pd.read_sql(cau5c1,conn)

      name  total_spent
0      Bob       2000.0
1  Charlie       1500.0

In [75]:
cau5c2 = """SELECT c.name,
    (
        SELECT SUM(oi.quantity * p.price)
        FROM order_items oi
        INNER JOIN products p ON oi.product_id = p.id
        WHERE oi.order_id IN (
            SELECT o.id
            FROM orders o
            WHERE o.customer = c.id
        )
    ) AS total_spent
FROM customers c
HAVING total_spent > (
    SELECT AVG(total_spent)
    FROM (
        SELECT 
            (
                SELECT SUM(oi.quantity * p.price)
                FROM order_items oi
                INNER JOIN products p ON oi.product_id = p.id
                WHERE oi.order_id IN (
                    SELECT o.id
                    FROM orders o
                    WHERE o.customer = c.id
                )
            ) AS total_spent
        FROM customers c
    ) AS avg_spent
);


"""
cau5df2 = pd.read_sql(cau5c2,conn)
cau5df2

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_20904\2886457797.py:33: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cau5df2 = pd.read_sql(cau5c2,conn)

      name  total_spent
0      Bob       1800.0
1  Charlie       1500.0

Tạo bảng tạm khách hàng VIP
Tạo bảng tạm vip_customers gồm những khách hàng có tổng giá trị đơn hàng lớn
hơn 1000.
Sau đó, hiển thị tên và tổng chi tiêu của các khách hàng trong bảng tạm này.

In [13]:
query6join = """CREATE TEMPORARY TABLE vip_customers AS
            SELECT c.name , c.id ,  sum(o.total * ot.quantity) as total
            FROM orders o 
            JOIN customers c   On c.id = o.customer
            JOIN order_items  ot ON o.id = ot.order_id 
            GROUP BY c.name,c.id
            HAVING total > 1000;"""
cursor = conn.cursor()
cursor.execute(query6join)

In [12]:
querydrop = """DROP TEMPORARY TABLE IF EXISTS vip_customers;"""
cursor.execute(querydrop)

In [14]:
query6join1 = "SELECT * FROM vip_customers;"
cau6df1 = pd.read_sql(query6join1, conn)
print(cau6df1)

      name  id   total
0    Alice   1  1800.0
1      Bob   2  1600.0
2  Charlie   3  1200.0

C:\Users\Learning\AppData\Local\Temp\ipykernel_17080\3711229784.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cau6df1 = pd.read_sql(query6join1, conn)

In [ ]:
query6join = """CREATE TEMPORARY TABLE vip_customers AS
            SELECT c.name , c.id ,  sum(o.total * ot.quantity) as total
            FROM orders o 
            JOIN customers c   On c.id = o.customer
            JOIN order_items  ot ON o.id = ot.order_id 
            GROUP BY c.name,c.id
            HAVING total > 1000;"""
cursor = conn.cursor()
cursor.execute(query6join)

In [23]:
query6sub = """CREATE TEMPORARY TABLE vip_customer AS
            SELECT 
                c.id,
                c.name,
                (
                    SELECT SUM(
                        o.total * (
                            SELECT SUM(quantity)
                            FROM order_items
                            WHERE order_id = o.id
                        )
                    )
                    FROM orders o
                    WHERE o.customer = c.id
                ) AS total
            FROM customers c
            HAVING total > 1000;



            """
cursor = conn.cursor()
cursor.execute(query6sub)

In [22]:
querydrop = """DROP TEMPORARY TABLE IF EXISTS vip_customer;"""
cursor.execute(querydrop)

In [24]:
query6sub = "SELECT * FROM vip_customer;"
cau6df2 = pd.read_sql(query6sub, conn)
print(cau6df2)

   id     name   total
0   1    Alice  1800.0
1   2      Bob  1600.0
2   3  Charlie  1200.0

C:\Users\Learning\AppData\Local\Temp\ipykernel_17080\2261310173.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cau6df2 = pd.read_sql(query6sub, conn)

7.
Tạo bảng tạm sản phẩm phổ biến
Tạo bảng tạm popular_products gồm những sản phẩm được bán ra với tổng số lượng
từ 2 trở lên.
Hiển thị tên và tổng số lượng bán ra của các sản phẩm nà

In [39]:
query7join="""CREATE TEMPORARY TABLE popular_products AS
            SELECT 
                p.name, 
                p.id, 
                SUM(ot.quantity) AS SL
            FROM products p
            JOIN order_items ot ON p.id = ot.product_id
            GROUP BY p.id, p.name
            HAVING SL >= 2;"""

cursor = conn.cursor()
cursor.execute(query7join)

In [38]:
querydrop = """DROP TEMPORARY TABLE IF EXISTS popular_products;"""
cursor.execute(querydrop)

In [40]:
query_show = "SELECT * FROM popular_products;"
df_popular = pd.read_sql(query_show, conn)
df_popular

C:\Users\Learning\AppData\Local\Temp\ipykernel_17080\1884782070.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_popular = pd.read_sql(query_show, conn)

     name  id   SL
0  Laptop   1  2.0
1   Mouse   2  2.0

In [45]:
query7sub = """CREATE TEMPORARY TABLE popular_product AS
                SELECT 
                    p.name, 
                    p.id,
                    (
                        SELECT SUM(quantity)
                        FROM order_items
                        WHERE product_id = p.id
                    ) AS total_quantity
                FROM products p
                WHERE (
                    SELECT SUM(quantity)
                    FROM order_items
                    WHERE product_id = p.id
                ) >= 2;
"""
cursor = conn.cursor()
cursor.execute(query7sub)

In [46]:
query_show1 = "SELECT * FROM popular_product;"
df_popular1 = pd.read_sql(query_show1, conn)
df_popular1

C:\Users\Learning\AppData\Local\Temp\ipykernel_17080\919336230.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_popular1 = pd.read_sql(query_show1, conn)

     name  id  total_quantity
0  Laptop   1             2.0
1   Mouse   2             2.0

Subquery lồng nhau nhiều cấp
Liệt kê tên các khách hàng có đơn hàng được xử lý bởi nhân viên có tổng doanh số
lớn hơn 1000.

In [49]:
query8sub = """SELECT 
                    e.name, 
                    e.id, 
                    SUM(ot.quantity * p.price) AS total_sales
                FROM order_assignments AS oa
                JOIN employees AS e ON e.id = oa.employee_id
                JOIN orders AS o ON oa.order_id = o.id
                JOIN order_items AS ot ON o.id = ot.order_id 
                JOIN products AS p ON p.id = ot.product_id 
                JOIN customers AS c ON o.customer = c.id
                GROUP BY e.name, e.id
                HAVING SUM(ot.quantity * p.price) > 1000;
 """
cau8df1 = pd.read_sql(query8sub,conn)
cau8df1.tail()

C:\Users\Learning\AppData\Local\Temp\ipykernel_17080\1554164473.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cau8df1 = pd.read_sql(query8sub,conn)

    name  id  total_sales
0  Frank   3       1800.0
1   Emma   2       1500.0

In [56]:
query8join = """SELECT e.name
FROM employees AS e
WHERE e.id IN (
    SELECT oa.employee_id 
    FROM order_assignments AS oa
    WHERE oa.order_id IN (
        SELECT o.id 
        FROM orders AS o
        WHERE o.id IN (
            SELECT ot.order_id 
            FROM order_items AS ot
            WHERE ot.product_id IN (
                SELECT p.id
                FROM products AS p
                WHERE p.price > 100
            )
        )
    )
)
AND (
    SELECT SUM(ot.quantity * p.price)
    FROM order_items AS ot
    JOIN products AS p ON ot.product_id = p.id
    WHERE ot.order_id IN (
        SELECT o.id
        FROM orders AS o
        WHERE o.id IN (
            SELECT oa.order_id
            FROM order_assignments AS oa
            WHERE oa.employee_id = e.id
        )
    )
) > 1000;

"""

In [52]:
query8join = query8join.replace("order_assigments", "order_assignments")

In [57]:
cau8df2 = pd.read_sql(query8join,conn)
cau8df2.tail()

C:\Users\Learning\AppData\Local\Temp\ipykernel_17080\2347954126.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cau8df2 = pd.read_sql(query8join,conn)

    name
0  Frank
1   Emma

In [6]:
cursor = conn.cursor()
query = """
CREATE TEMPORARY TABLE high_value_orders AS
SELECT id AS order_id, customer, order_date
FROM orders
WHERE (
    SELECT SUM(
        (SELECT price 
         FROM products 
         WHERE products.id = oi.product_id) 
        * oi.quantity
    )
    FROM order_items oi
    WHERE oi.order_id = orders.id
) > 800;
"""
cursor.execute(query)
conn.commit()

In [7]:
import pandas as pd
query = """
SELECT DISTINCT c.name
FROM customers c
JOIN high_value_orders hvo ON hvo.customer = c.id;
"""
cauXdf = pd.read_sql(query, conn)
cauXdf.head()

C:\Users\Learning\AppData\Local\Temp\ipykernel_11464\1518038634.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cauXdf = pd.read_sql(query, conn)

      name
0      Bob
1  Charlie

In [8]:
query10="""SELECT o.id AS order_id,
       (
           SELECT SUM(oi.quantity * p.price)
           FROM order_items oi
           JOIN products p ON oi.product_id = p.id
           WHERE oi.order_id = o.id
       ) AS total_value
FROM orders o;"""
cau10 = pd.read_sql(query10,conn)
cau10.tail()

C:\Users\Learning\AppData\Local\Temp\ipykernel_11464\2822730175.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cau10 = pd.read_sql(query10,conn)

   order_id  total_value
0         1        250.0
1         2       1800.0
2         3       1500.0
3         4          NaN